# Color Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Color Properties
Color Class See Also
---
The Color type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Blue | Get the blue channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead. |
| Green | Get the green channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead. |
| InvalidColorValue | Get the invalid Color whose IntegerValue is -1. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| IsValid | Identifies if the color represents a valid color, or an uninitialized/invalid value. |
| Red | Get the red channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead. |

# See Also
Color Class
Autodesk.Revit.DB Namespace